In [10]:
import pandas as pd
path="F:\\PythonL\\Data\\Saamplestoredata.xlsx"
df=pd.read_excel(path)
df.head()
df.describe()

,Order ID,Customer ID,Product Shipped,Revenue,Cost,Order Date
count,2483.000000,2483.000000,2483.000000,2483.000000,2483.000000,2483
mean,553332.867902,543486.633508,516.894080,2584.470399,1292.235199,2021-07-10 04:32:34.409988
min,100049.000000,152689.000000,50.000000,250.000000,125.000000,2020-01-01 00:00:00
25%,325652.000000,325698.000000,282.500000,1412.500000,706.250000,2020-10-13 00:00:00
50%,550193.000000,325698.000000,513.000000,2565.000000,1282.500000,2021-07-15 00:00:00
75%,785905.500000,785432.000000,754.500000,3772.500000,1886.250000,2022-03-29 12:00:00
max,999861.000000,985245.000000,1000.000000,5000.000000,2500.000000,2022-12-30 00:00:00
std,259580.026888,325284.048621,271.390391,1356.951954,678.475977,NaN

In [22]:
path="F:\\PythonL\\Data\\cleaned_food_data.csv"
df=pd.read_csv(path)
df.head(1)

path22="F:\\PythonL\\Data\\Saamplestoredata.xlsx"

df2=pd.read_excel(path22,sheet_name="Customers")
df2

,Customer ID,Customer Name,Phone,Address,City,State,Zip,Country
0,152689,Udupi Restaurants,999-999-9999,Kondpur,Hydrabad,TS,98121,India
1,452584,Jk Grocery Stores,801-583-8695,DWArka,Ahmedabad,GT,84113,India
2,985245,MT Convenience Stores,920-419-6270,Sahara pur,Delhi,DL,54303,India
3,785432,EATFRESh LLC,347-789-7688,Indranagar,Bengaluru,KA,11743,INNdia
4,325698,HXSG Grovers,251-655-2909,Hitech city,Hydrabad,TS,98121,INNdia

In [39]:
df3=df[["Customer ID"]]
df3

      Customer ID
0          152689
1          325698
2          325698
3          452584
4          452584
...           ...
2478       325698
2479       152689
2480       785432
2481       985245
2482       452584

[2483 rows x 1 columns]

In [40]:
df4=df[df["Customer ID"]==1001]
df4

Empty DataFrame
Columns: [Order ID, Customer ID, Rush Shipment, Product Shipped, Revenue, Cost, Order Date]
Index: []